In [4]:
import pandas as pd
import numpy as np
from word2number import w2n
df = pd.read_csv("C:\\Users\\hp\\Desktop\\Machine learning practice\\hiring.csv")
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   experience                  6 non-null      object
 1   test_score(out of 10)       7 non-null      float64
 2   interview_score(out of 10)  8 non-null      int64
 3   salary($)                   8 non-null      int64
dtypes: float64(1), int64(2), object(1)
memory usage: 384.0+ bytes

In [11]:
df['experience'].fillna('zero',inplace=True)

In [12]:
df['experience'].str
df.experience = df.experience.apply(w2n.word_to_num)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [13]:
df['test_score(out of 10)'].fillna(df['test_score(out of 10)'].median(),inplace=True)

In [14]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

In [15]:
X = df[['experience','test_score(out of 10)','interview_score(out of 10)']]
y = df[['salary($)']]

In [16]:
from sklearn.model_selection import train_test_split

In [38]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2)

In [39]:
X_train

   experience  test_score(out of 10)  interview_score(out of 10)
0           0                    8.0                           9
3           2                   10.0                          10
5           3                    7.0                          10
4           7                    9.0                           6
6          10                    8.0                           7
2           5                    6.0                           7

In [40]:
X_test

   experience  test_score(out of 10)  interview_score(out of 10)
7          11                    7.0                           8
1           0                    8.0                           6

In [41]:
from sklearn.linear_model import LinearRegression

In [42]:
clf = LinearRegression()

In [43]:
clf.fit(X_train,y_train)

LinearRegression()

In [44]:
clf.predict(X_test)

array([[76748.27586207],
       [48995.07389163]])

In [45]:
print("Accuracy: ",clf.score(X_test,y_test)*100,"%")

Accuracy:  95.66786526224459 %